# 45 - Memadukan `loc` dan `iloc` untuk Melakukan Seleksi Data

## Import Modules
### Module yang digunakan :
1. pandas

In [1]:
import pandas as pd

- Mengecheck versi dari module yang digunakan yaitu pandas

In [2]:
print(pd.__version__)

1.0.5

## Membuat Data Frame

1. Membuat data set titanicfull.csv menjadi format data frame dengan menggunakan method pd.read_csv.
2. Menampilkan 5 baris dari hasil data frame yang telah dibuat menggunakan method *df.head()*.

In [3]:
df = pd.read_csv('C:/Users/ASUS/Desktop/Belajar-Python-Pandas/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

## Memadukan `loc` dan `iloc` untuk Melakukan Seleksi Data

- Memanggil `iloc` untuk melakukan seleksi data berdasarkan index. Disini kita akan menggunakannya untuk menyeleksi baris dengan index ke 15 sampai 19. index pertama inklusive sedangkan index kedua exclusive.
    - `iloc[baris : kolom]`sehingga memanggil `iloc[15:20, :]
- Memanggil `loc` untuk melakukan seleksi data berdasarkan nama kolom. Disini kita akan menggunakannya untuk menyeleksi kolom name dan age.
    - `loc[baris : kolom]` sehingga memanggil `loc[:, 'name' : 'age']`

In [4]:
df.iloc[15:20, :].loc[:, 'name':'age']

                                               name     sex   age
15                              Baumann, Mr. John D    male   NaN
16                         Baxter, Mr. Quigg Edmond    male  24.0
17  Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female  50.0
18                            Bazzani, Miss. Albina  female  32.0
19                             Beattie, Mr. Thomson    male  36.0

- Memanggil `loc` untuk melakukan seleksi data berdasarkan nama kolom. Disini kita akan menggunakannya untuk menyeleksi kolom name dan age.
    - `loc[baris : kolom]` sehingga memanggil `loc[:, 'name' : 'age']`
- Memanggil `iloc` untuk melakukan seleksi data berdasarkan index. Disini kita akan menggunakannya untuk menyeleksi baris dengan index ke 15 sampai 19. index pertama inklusive sedangkan index kedua exclusive.
    - `iloc[baris : kolom]`sehingga memanggil `iloc[15:20, :]`

In [5]:
df.loc[:, 'name':'age'].iloc[15:20, :]

                                               name     sex   age
15                              Baumann, Mr. John D    male   NaN
16                         Baxter, Mr. Quigg Edmond    male  24.0
17  Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female  50.0
18                            Bazzani, Miss. Albina  female  32.0
19                             Beattie, Mr. Thomson    male  36.0